podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SMC_S32K14x.svd.xml
<!--
Devices using this peripheral: 
      S32K142
      S32K144
      S32K146
      S32K148
-->
      <peripheral>
         <?sourceFile "SMC_S32K14x" ?>
         <name>SMC</name>
         <description>System Mode Controller</description>
         <groupName>SMC</groupName>
         <headerStructName>SMC</headerStructName>
         <baseAddress>0x4007E000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x18</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>VERID</name>
               <description>SMC Version ID Register</description>
               <addressOffset>0x0</addressOffset>
               <access>read-only</access>
               <resetValue>0x1000000</resetValue>
               <fields>
                  <field>
                     <name>FEATURE</name>
                     <description>Feature Specification Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Standard features implemented</description>
                           <value>0b0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MINOR</name>
                     <description>Minor Version Number</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MAJOR</name>
                     <description>Major Version Number</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PARAM</name>
               <description>SMC Parameter Register</description>
               <addressOffset>0x4</addressOffset>
               <access>read-only</access>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>EHSRUN</name>
                     <description>Existence of HSRUN feature</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The feature is not available</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The feature is available</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="EHSRUN" > <name>ELLS</name> <description>Existence of LLS feature</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="EHSRUN" > <name>ELLS2</name> <description>Existence of LLS2 feature</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="EHSRUN" > <name>EVLLS0</name> <description>Existence of VLLS0 feature</description> <bitOffset>6</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PMPROT</name>
               <description>Power Mode Protection Register</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>AVLP</name>
                     <description>Allow Very-Low-Power Modes\n
Provided the appropriate control bits are set up in PMCTRL, this write-once field allows the MCU to enter
any very-low-power mode (VLPR, VLPW, and VLPS)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>VLPR and VLPS not allowed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>VLPR and VLPS allowed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AHSRUN</name>
                     <description>Allow High Speed Run mode\n
This write-once field allows the MCU to enter High Speed Run mode (HSRUN)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>HSRUN not allowed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>HSRUN allowed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMCTRL</name>
               <description>Power Mode Control Register</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>STOPM</name>
                     <description>Stop Mode Control\n
When written, controls entry into the selected stop mode when Sleep-Now or Sleep-On-Exit mode is entered with SLEEPDEEP=1.\n
Writes to this field are blocked if the protection level has not been enabled using the PMPROT register.\n
After any system reset, this field is cleared by hardware on any successful write to the PMPROT register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>Normal Stop (STOP)</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>Reserved</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>Very-Low-Power Stop (VLPS)</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011</name>
                           <description>Reserved</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100</name>
                           <description>Reserved</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101</name>
                           <description>Reserved</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b110</name>
                           <description>Reserved</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b111</name>
                           <description>Reserved</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VLPSA</name>
                     <description>Very Low Power Stop Aborted\n
This status field indicates an interrupt or reset occurred during the previous stop mode entry sequence, 
preventing the system from entering that mode.
NOTE: This bit will not get set if STOP1/STOP2 get aborted</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Stop mode entry successful</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Stop mode entry aborted</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RUNM</name>
                     <description>Run Mode Control\n
When written, causes entry into the selected run mode.\n
Writes to this field are blocked if the protection level has not been enabled using the PMPROT register.\n
This field is cleared by hardware on any exit to normal RUN mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Normal Run mode (RUN)</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Reserved</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Very-Low-Power Run mode (VLPR)</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>High Speed Run mode (HSRUN)</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>STOPCTRL</name>
               <description>Stop Control Register\n
Provides various control bits allowing the user to fine tune
power consumption during the stop mode selected by the STOPM field</description>
               <addressOffset>0x10</addressOffset>
               <resetValue>0x3</resetValue>
               <fields>
                  <field>
                     <name>PSTOPO</name>
                     <?ignoreOverlap?>
                     <?hide?>
                     <description>Stop Option\n
These bits control which Stop mode is entered when STOPM=STOP</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Reserved</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>PSTOP1 - System and bus clocks disabled</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>PSTOP2 - System clock disabled</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Reserved</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>STOPO</name>
                     <description>Stop Option\n
These bits control which Stop mode is entered when STOPM=STOP</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Reserved</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>STOP1 - System and bus clocks disabled</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>STOP2 - System clock disabled</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Reserved</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMSTAT</name>
               <description>Power Mode Status Register</description>
               <addressOffset>0x14</addressOffset>
               <access>read-only</access>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>PMSTAT</name>
                     <description>Power Mode Status\nIndicates current power mode\n
When debug is enabled, the PMSTAT will not update to STOP or VLPS\n
When a PSTOP mode is enabled, the PMSTAT will not update to STOP or VLPS</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00000001</name>
                           <description>RUN</description>
                           <value>0b00000001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b00000010</name>
                           <description>STOP</description>
                           <value>0b00000010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b00000100</name>
                           <description>VLPR</description>
                           <value>0b00000100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b00001000</name>
                           <description>VLPW</description>
                           <value>0b00001000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b00010000</name>
                           <description>VLPS</description>
                           <value>0b00010000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b00100000</name>
                           <description>LLS</description>
                           <value>0b00100000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01000000</name>
                           <description>VLLS</description>
                           <value>0b01000000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10000000</name>
                           <description>HSRUN</description>
                           <value>0b10000000</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
